ams/src/Documents/_РасчетЗарплаты/_РасчетЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>_РасчетЗарплаты</name>
  <registerRecords>InformationRegister._Зарплата</registerRecords>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef._СтатусыПриемаТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Водители</name>
    <attributes>
      <name>МестоПогрузки</name>
      <type>
        <types>EnumRef._МестаПогрузки</types>
      </type>
    </attributes>
    <attributes>
      <name>Работа</name>
      <type>
        <types>CatalogRef._Работы</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Подработка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГрузчикиВМашина</name>
    <attributes>
      <name>МестоПогрузки</name>
      <type>
        <types>EnumRef._МестаПогрузки</types>
      </type>
    </attributes>
    <attributes>
      <name>Работа</name>
      <type>
        <types>CatalogRef._Работы</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Подработка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДопРаботы</name>
    <attributes>
      <name>МестоПогрузки</name>
      <type>
        <types>EnumRef._МестаПогрузки</types>
      </type>
    </attributes>
    <attributes>
      <name>Работа</name>
      <type>
        <types>CatalogRef._Работы</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Подработка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Кладовщики</name>
    <attributes>
      <name>МестоПогрузки</name>
      <type>
        <types>EnumRef._МестаПогрузки</types>
      </type>
    </attributes>
    <attributes>
      <name>Работа</name>
      <type>
        <types>CatalogRef._Работы</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Подработка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комплектовщики</name>
    <attributes>
      <name>МестоПогрузки</name>
      <type>
        <types>EnumRef._МестаПогрузки</types>
      </type>
    </attributes>
    <attributes>
      <name>Работа</name>
      <type>
        <types>CatalogRef._Работы</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Подработка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Обмотчики</name>
    <attributes>
      <name>МестоПогрузки</name>
      <type>
        <types>EnumRef._МестаПогрузки</types>
      </type>
    </attributes>
    <attributes>
      <name>Работа</name>
      <type>
        <types>CatalogRef._Работы</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Подработка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ams/src/InformationRegisters/_ЦеныРабот/_ЦеныРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>_ЦеныРабот</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </resources>
  <dimensions>
    <name>Работа</name>
    <type>
      <types>CatalogRef._Работы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ams/src/Enums/_МестаПогрузки/_МестаПогрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>_МестаПогрузки</name>
  <enumValues>
    <name>Основной</name>
  </enumValues>
  <enumValues>
    <name>Верхний</name>
  </enumValues>
</mdclass:Enum>

ams/src/Catalogs/_Работы/_Работы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>_Работы</name>
  <predefined>
    <items>
      <name>Грузчик1_</name>
      <description>Грузчик (цех 1, разводящий спирт)</description>
    </items>
    <items>
      <name>Грузчик1</name>
      <description>Грузчик (цех 1)</description>
    </items>
    <items>
      <name>Грузчик2</name>
      <description>Грузчик (цех 2)</description>
    </items>
    <items>
      <name>Грузчик3</name>
      <description>Грузчик (цех 3)</description>
    </items>
    <items>
      <name>СкладКомплектовщикВерхний</name>
      <description>Комплектовка палет на верхнем складе</description>
    </items>
    <items>
      <name>СкладКомплектовщик</name>
      <description>Комплектовка палет на основном складе</description>
    </items>
    <items>
      <name>Механик3_1</name>
      <description>Наладчик производственного оборудования (механик 1 кат цех 3)</description>
    </items>
    <items>
      <name>Механик3_2</name>
      <description>Наладчик производственного оборудования (механик 2 кат. цех 3)</description>
    </items>
    <items>
      <name>Механик3_3</name>
      <description>Наладчик производственного оборудования (механик 3 кат. цех 3)</description>
    </items>
    <items>
      <name>Механик1_</name>
      <description>Наладчик производственного оборудования (механик бригадир цех 1)</description>
    </items>
    <items>
      <name>Механик1</name>
      <description>Наладчик производственного оборудования (механик цех 1)</description>
    </items>
    <items>
      <name>Механик2</name>
      <description>Наладчик производственного оборудования (механик цех 2)</description>
    </items>
    <items>
      <name>СкладОбмотчикВерхний</name>
      <description>Обмотка палет на верхнем складе</description>
    </items>
    <items>
      <name>СкладОбмотчик</name>
      <description>Обмотка палет на основном складе</description>
    </items>
    <items>
      <name>СкладВодительВерхний</name>
      <description>Погрузочные работы на верхнем складе (погрузчик)</description>
    </items>
    <items>
      <name>СкладВодитель</name>
      <description>Погрузочные работы на основном складе (погрузчик)</description>
    </items>
    <items>
      <name>Замесчик1</name>
      <description>Производство фабриката (цех 1)</description>
    </items>
    <items>
      <name>Замесчик2</name>
      <description>Производство фабриката (цех 2)</description>
    </items>
    <items>
      <name>Замесчик3</name>
      <description>Производство фабриката (цех 3)</description>
    </items>
    <items>
      <name>Кладовщик1</name>
      <description>Складские работы (цех 1)</description>
    </items>
    <items>
      <name>Кладовщик2</name>
      <description>Складские работы (цех 2)</description>
    </items>
    <items>
      <name>Кладовщик3</name>
      <description>Складские работы (цех 3)</description>
    </items>
    <items>
      <name>СкладКладовщикВерхний</name>
      <description>Складские работы на верхнем складе (кладовщик)</description>
    </items>
    <items>
      <name>СкладКладовщик</name>
      <description>Складские работы на основном складе (кладовщик)</description>
    </items>
    <items>
      <name>СкладГрузчикВМашинеВерхний</name>
      <description>Укладка палет в машины на верхнем складе</description>
    </items>
    <items>
      <name>СкладГрузчикВМашине</name>
      <description>Укладка палет в машины на основном складе</description>
    </items>
    <items>
      <name>Фасовка1</name>
      <description>Фасовка продукции (цех 1)</description>
    </items>
    <items>
      <name>Фасовка2</name>
      <description>Фасовка продукции (цех 2)</description>
    </items>
    <items>
      <name>Фасовка3</name>
      <description>Фасовка продукции (цех 3)</description>
    </items>
  </predefined>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
</mdclass:Catalog>

ams/src/Documents/_РасчетЗарплаты/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КоличествоОсновныхРабот = Объект.Водители.Количество() + Объект.ГрузчикиВМашина.Количество()
		+ Объект.Кладовщики.Количество() + Объект.Комплектовщики.Количество() + Объект.Обмотчики.Количество();
	Элементы.ДопРаботыСотрудник.СписокВыбора.ЗагрузитьЗначения(AMS_Сервер.ПолучитьСотрудниковСкладаПродукции());
	Элементы.ДопРаботыРабота.СписокВыбора.ЗагрузитьЗначения(ПолучитьДопРаботы());
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница = Элементы.СтрСтоимостьРабот Тогда
		ПоказатьСтоимостьРабот();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКладовщики

&НаКлиенте
Процедура КладовщикиПодработкаПриИзменении(Элемент)
	Стр = ТекущийЭлемент.ТекущиеДанные;
	Стр.Сумма = Стр.Цена * Стр.Количество * Стр.Подработка;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКомплектовщики

&НаКлиенте
Процедура КомплектовщикиПодработкаПриИзменении(Элемент)
	Стр = ТекущийЭлемент.ТекущиеДанные;
	Стр.Сумма = Стр.Цена * Стр.Количество * Стр.Подработка;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОбмотчики

&НаКлиенте
Процедура ОбмотчикиПодработкаПриИзменении(Элемент)
	Стр = ТекущийЭлемент.ТекущиеДанные;
	Стр.Сумма = Стр.Цена * Стр.Количество * Стр.Подработка;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыГрузчикиВМашина

&НаКлиенте
Процедура ГрузчикиВМашинаПодработкаПриИзменении(Элемент)
	Стр = ТекущийЭлемент.ТекущиеДанные;
	Стр.Сумма = Стр.Цена * Стр.Количество * Стр.Подработка;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВодители

&НаКлиенте
Процедура ВодителиПодработкаПриИзменении(Элемент)
	Стр = ТекущийЭлемент.ТекущиеДанные;
	Стр.Сумма = Стр.Цена * Стр.Количество * Стр.Подработка;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДопРаботы

&НаКлиенте
Процедура ДопРаботыРаботаПриИзменении(Элемент)
	Стр = ТекущийЭлемент.ТекущиеДанные;

	Стр.Цена       = ПолучитьСтоимостьРаботы(Стр.Работа, Объект.Дата);
	Стр.Подработка = ?(Стр.Подработка = 0, 1, Стр.Подработка);
	Стр.Количество = ?(Стр.Количество = 0, 1, Стр.Количество);

	Стр.Сумма = Стр.Цена * Стр.Количество * Стр.Подработка;
КонецПроцедуры

&НаКлиенте
Процедура ДопРаботыПодработкаПриИзменении(Элемент)
	Стр = ТекущийЭлемент.ТекущиеДанные;
	Стр.Сумма = Стр.Цена * Стр.Количество * Стр.Подработка;
КонецПроцедуры

&НаКлиенте
Процедура ДопРаботыКоличествоПриИзменении(Элемент)
	Стр = ТекущийЭлемент.ТекущиеДанные;
	Стр.Сумма = Стр.Цена * Стр.Количество * Стр.Подработка;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	Если КоличествоОсновныхРабот > 0 Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ОбратоткаКомандыЗаполнитьЗавершение", ЭтотОбъект), НСтр(
			"ru = 'Данные об Основных работах будут очищены. Очистить данные и продолжить?'"), РежимДиалогаВопрос.ДаНет);
	Иначе
		Модифицированность = Истина;
		ЗаполнитьТЗРаботы();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтчетНачисленоПоДокументу(Команда)
	Если Модифицированность Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ОтчетНачисленоПоДокументуЗавершение", ЭтотОбъект), НСтр(
			"ru = 'Документ изменён. Записать документ и продолжить?'"), РежимДиалогаВопрос.ДаНет);

	Иначе
		ПоказатьНачисленоПоДокументу();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтчетНачисленоСотруднику(Команда)
	Если Модифицированность Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ОтчетНачисленоСотрудникуЗавершение", ЭтотОбъект), НСтр(
			"ru = 'Документ изменён. Записать документ и продолжить?'"), РежимДиалогаВопрос.ДаНет);

	Иначе
		ПоказатьНачисленоСотруднику();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтчетНачисленоЗаПериод(Команда)
	Если Модифицированность Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ОтчетНачисленоЗаПериодЗавершение", ЭтотОбъект), НСтр(
			"ru = 'Документ изменён. Записать документ и продолжить?'"), РежимДиалогаВопрос.ДаНет);

	Иначе
		ПоказатьНачисленоЗаПериод();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДвижениеДокумента(Команда)
	СсылкаНаОбъект = Объект.Ссылка;
	Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ВидимостьКомандВариантовОтчетов", Ложь);
		ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
		ПараметрыФормы.Вставить("ПараметрКоманды", СсылкаНаОбъект);

		ОткрытьФорму("Отчет.ДвиженияДокумента.Форма", ПараметрыФормы, ЭтотОбъект, Истина);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьДопРаботы()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СкладПродукции", AMS_ВызовСервера.СкладПродукции());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник._Работы КАК т
	|ГДЕ
	|	т.Склад = &СкладПродукции
	|	И НЕ т.ПометкаУдаления
	|	И НЕ т.Предопределенный
	|
	|УПОРЯДОЧИТЬ ПО
	|	т.Наименование";

	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
КонецФункции

&НаКлиенте
Процедура ОбратоткаКомандыЗаполнитьЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Модифицированность = Истина;
		ЗаполнитьТЗРаботы();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЗРаботы()
	Пакет = ПолучитьПакетРезультатовЗапросов(Объект.Дата, Объект.Склад);

	ЗаполнитьТЧ(Пакет.Водители, Объект.Водители);
	ЗаполнитьТЧ(Пакет.ГрузчикиВМашина, Объект.ГрузчикиВМашина);
	ЗаполнитьТЧ(Пакет.Кладовщики, Объект.Кладовщики);
	ЗаполнитьТЧ(Пакет.Комплектовщики, Объект.Комплектовщики);
	ЗаполнитьТЧ(Пакет.Обмотчики, Объект.Обмотчики);

	КоличествоОсновныхРабот = Объект.Водители.Количество() + Объект.ГрузчикиВМашина.Количество()
		+ Объект.Кладовщики.Количество() + Объект.Комплектовщики.Количество() + Объект.Обмотчики.Количество();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьТЧ(Рез, Табл)
	Табл.Очистить();

	Выб = Рез.Выбрать();
	Пока Выб.Следующий() Цикл
		Стр = Табл.Добавить();
		ЗаполнитьЗначенияСвойств(Стр, Выб);
		Стр.Примечание = Выб.Номер + " от " + Формат(Выб.Дата, "ДЛФ=Д") + " г. " + Выб.Партнер;
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПакетРезультатовЗапросов(Дата, Склад)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	д.Ссылка КАК Ссылка,
	|	д._ВесОсновной КАК ВесОсновной,
	|	д._ВесВерхний КАК ВесВерхний,
	|	т.Распоряжение КАК Распоряжение
	|ПОМЕСТИТЬ ордера
	|ИЗ
	|	Документ.РасходныйОрдерНаТовары КАК д
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК т
	|		ПО д.Ссылка = т.Ссылка
	|ГДЕ
	|	д.Проведен
	|	И д.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.Отгружен)
	|	И д.ДатаОтгрузки МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ордера.Ссылка КАК Ссылка,
	|	ордера.ВесОсновной КАК ВесОсновной,
	|	ордера.ВесВерхний КАК ВесВерхний,
	|	Реал.Номер КАК Номер,
	|	Реал.Дата КАК Дата,
	|	ПРЕДСТАВЛЕНИЕ(Реал.Партнер) КАК Партнер
	|ПОМЕСТИТЬ док
	|ИЗ
	|	ордера КАК ордера
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК Реал
	|		ПО ордера.Распоряжение = Реал.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ордера.Ссылка,
	|	ордера.ВесОсновной,
	|	ордера.ВесВерхний,
	|	Перемещение.Номер,
	|	Перемещение.Дата,
	|	ПРЕДСТАВЛЕНИЕ(Перемещение.Организация)
	|ИЗ
	|	ордера КАК ордера
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров КАК Перемещение
	|		ПО ордера.Распоряжение = Перемещение.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	док.Номер КАК Номер,
	|	док.Дата КАК Дата,
	|	док.Партнер КАК Партнер,
	|	РаботыВОрдере.МестоПогрузки КАК МестоПогрузки,
	|	РаботыВОрдере.Работа КАК Работа,
	|	РаботыВОрдере.Сотрудник КАК Сотрудник,
	|	1 КАК Подработка,
	|	ВЫБОР
	|		КОГДА РаботыВОрдере.МестоПогрузки = ЗНАЧЕНИЕ(Перечисление._МестаПогрузки.Основной)
	|			ТОГДА док.ВесОсновной
	|		ИНАЧЕ док.ВесВерхний
	|	КОНЕЦ КАК Количество,
	|	РегЦен.Цена КАК Цена,
	|	ВЫБОР
	|		КОГДА РаботыВОрдере.МестоПогрузки = ЗНАЧЕНИЕ(Перечисление._МестаПогрузки.Основной)
	|			ТОГДА док.ВесОсновной * РегЦен.Цена
	|		ИНАЧЕ док.ВесВерхний * РегЦен.Цена
	|	КОНЕЦ КАК Сумма
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	док КАК док
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйОрдерНаТовары._Работы КАК РаботыВОрдере
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений._ЦеныРабот.СрезПоследних(&Дата, ) КАК РегЦен
	|			ПО РаботыВОрдере.Работа = РегЦен.Работа
	|		ПО док.Ссылка = РаботыВОрдере.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.Номер КАК Номер,
	|	вт.Дата КАК Дата,
	|	вт.Партнер КАК Партнер,
	|	вт.МестоПогрузки КАК МестоПогрузки,
	|	вт.Работа КАК Работа,
	|	вт.Сотрудник КАК Сотрудник,
	|	вт.Подработка КАК Подработка,
	|	вт.Количество КАК Количество,
	|	вт.Цена КАК Цена,
	|	вт.Сумма КАК Сумма
	|ИЗ
	|	вт КАК вт
	|ГДЕ
	|	вт.Работа В (ЗНАЧЕНИЕ(Справочник._Работы.СкладВодитель), ЗНАЧЕНИЕ(Справочник._Работы.СкладВодительВерхний))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.Номер КАК Номер,
	|	вт.Дата КАК Дата,
	|	вт.Партнер КАК Партнер,
	|	вт.МестоПогрузки КАК МестоПогрузки,
	|	вт.Работа КАК Работа,
	|	вт.Сотрудник КАК Сотрудник,
	|	вт.Подработка КАК Подработка,
	|	вт.Количество КАК Количество,
	|	вт.Цена КАК Цена,
	|	вт.Сумма КАК Сумма
	|ИЗ
	|	вт КАК вт
	|ГДЕ
	|	вт.Работа В (ЗНАЧЕНИЕ(Справочник._Работы.СкладГрузчикВМашине), ЗНАЧЕНИЕ(Справочник._Работы.СкладГрузчикВМашинеВерхний))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.Номер КАК Номер,
	|	вт.Дата КАК Дата,
	|	вт.Партнер КАК Партнер,
	|	вт.МестоПогрузки КАК МестоПогрузки,
	|	вт.Работа КАК Работа,
	|	вт.Сотрудник КАК Сотрудник,
	|	вт.Подработка КАК Подработка,
	|	вт.Количество КАК Количество,
	|	вт.Цена КАК Цена,
	|	вт.Сумма КАК Сумма
	|ИЗ
	|	вт КАК вт
	|ГДЕ
	|	вт.Работа В (ЗНАЧЕНИЕ(Справочник._Работы.СкладКладовщик), ЗНАЧЕНИЕ(Справочник._Работы.СкладКладовщикВерхний))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.Номер КАК Номер,
	|	вт.Дата КАК Дата,
	|	вт.Партнер КАК Партнер,
	|	вт.МестоПогрузки КАК МестоПогрузки,
	|	вт.Работа КАК Работа,
	|	вт.Сотрудник КАК Сотрудник,
	|	вт.Подработка КАК Подработка,
	|	вт.Количество КАК Количество,
	|	вт.Цена КАК Цена,
	|	вт.Сумма КАК Сумма
	|ИЗ
	|	вт КАК вт
	|ГДЕ
	|	вт.Работа В (ЗНАЧЕНИЕ(Справочник._Работы.СкладКомплектовщик), ЗНАЧЕНИЕ(Справочник._Работы.СкладКомплектовщикВерхний))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.Номер КАК Номер,
	|	вт.Дата КАК Дата,
	|	вт.Партнер КАК Партнер,
	|	вт.МестоПогрузки КАК МестоПогрузки,
	|	вт.Работа КАК Работа,
	|	вт.Сотрудник КАК Сотрудник,
	|	вт.Подработка КАК Подработка,
	|	вт.Количество КАК Количество,
	|	вт.Цена КАК Цена,
	|	вт.Сумма КАК Сумма
	|ИЗ
	|	вт КАК вт
	|ГДЕ
	|	вт.Работа В (ЗНАЧЕНИЕ(Справочник._Работы.СкладОбмотчик), ЗНАЧЕНИЕ(Справочник._Работы.СкладОбмотчикВерхний))";
	Рез = Запрос.ВыполнитьПакет();

	Пакет = Новый Структура;
	Пакет.Вставить("Водители", Рез[3]);
	Пакет.Вставить("ГрузчикиВМашина", Рез[4]);
	Пакет.Вставить("Кладовщики", Рез[5]);
	Пакет.Вставить("Комплектовщики", Рез[6]);
	Пакет.Вставить("Обмотчики", Рез[7]);

	Возврат Пакет;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСтоимостьРаботы(Работа, Дата)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Работа", Работа);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Работа КАК Работа,
	|	т.Цена КАК Цена
	|ИЗ
	|	РегистрСведений._ЦеныРабот.СрезПоследних(&Дата, Работа = &Работа) КАК т";

	Рез = Запрос.Выполнить();

	Если Рез.Пустой() Тогда
		Возврат 0;

	Иначе
		Выб = Рез.Выбрать();
		Выб.Следующий();
		Возврат Выб.Цена;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ОтчетНачисленоПоДокументуЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Записать();
		ПоказатьНачисленоПоДокументу();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПоказатьНачисленоПоДокументу()
	День = Новый СтандартныйПериод;
	День.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
	День.ДатаНачала = НачалоДня(Объект.Дата);
	День.ДатаОкончания = КонецДня(Объект.Дата);

	Парам = Новый Структура;
	Парам.Вставить("Период", День);

	СКД = Документы._РасчетЗарплаты.ПолучитьМакет("скдНачислено");

	Настройки = СКД.ВариантыНастроек.Найти("НачисленоПоДокументу").Настройки;

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Настройки.Отбор, "Ссылка", Объект.Ссылка,
		ВидСравненияКомпоновкиДанных.Равно, , Истина);

	Начислено.Очистить();

	мср.ПолучитьДанныеНаОснованииСКД(СКД, Начислено, Настройки, Парам);
КонецПроцедуры

&НаКлиенте
Процедура ОтчетНачисленоСотрудникуЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Записать();
		ПоказатьНачисленоСотруднику();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПоказатьНачисленоСотруднику()
	Если Не ЗначениеЗаполнено(Сотрудник) Тогда
		ОбщегоНазначения.СообщитьПользователю("Не указан сотрудник.");
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Период) Тогда
		ОбщегоНазначения.СообщитьПользователю("Не указан период.");
		Возврат;
	КонецЕсли;

	СКД = Документы._РасчетЗарплаты.ПолучитьМакет("скдНачислено");

	Парам = Новый Структура;
	Парам.Вставить("Склад", Объект.Склад);
	Парам.Вставить("Период", Период);

	Настройки = СКД.ВариантыНастроек.Найти("НачисленоСотруднику").Настройки;

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Настройки.Отбор, "Сотрудник", Сотрудник,
		ВидСравненияКомпоновкиДанных.Равно, , Истина);

	Начислено.Очистить();

	мср.ПолучитьДанныеНаОснованииСКД(СКД, Начислено, Настройки, Парам);
КонецПроцедуры

&НаКлиенте
Процедура ОтчетНачисленоЗаПериодЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Записать();
		ПоказатьНачисленоЗаПериод();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПоказатьНачисленоЗаПериод()
	Если Не ЗначениеЗаполнено(Период) Тогда
		ОбщегоНазначения.СообщитьПользователю("Не указан период.");
		Возврат;
	КонецЕсли;

	Парам = Новый Структура;
	Парам.Вставить("Период", Период);

	СКД = Документы._РасчетЗарплаты.ПолучитьМакет("скдНачислено");

	Настройки = СКД.ВариантыНастроек.Найти("НачисленоЗаПериод").Настройки;

	Начислено.Очистить();

	мср.ПолучитьДанныеНаОснованииСКД(СКД, Начислено, Настройки, Парам);
КонецПроцедуры

&НаСервере
Процедура ПоказатьСтоимостьРабот()
	Парам = Новый Структура;
	Парам.Вставить("Период", Объект.Дата);

	СКД = Документы._РасчетЗарплаты.ПолучитьМакет("скдСтоимостьРабот");

	Настройки = СКД.НастройкиПоУмолчанию;

	СтоимостьРабот.Очистить();

	мср.ПолучитьДанныеНаОснованииСКД(СКД, СтоимостьРабот, Настройки, Парам);
КонецПроцедуры

#КонецОбласти
